changelog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-10 Sun 20:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Asynchronous HTTP Client - Clojure - Changelog</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Chris Hapgood" />
<link rel="stylesheet" type="text/css" href="stylesheet.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://github.com/cch1/http.async.client"> HOME </a>
</div><div id="content">
<h1 class="title">Asynchronous HTTP Client - Clojure - Changelog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga820956">1. Release 1.3.1</a>
<ul>
<li><a href="#org278c82b">1.1. Update dependencies</a></li>
</ul>
</li>
<li><a href="#org056f486">2. Release 1.3.0</a>
<ul>
<li><a href="#orgc039401">2.1. Update documentation</a></li>
<li><a href="#org0304cca">2.2. Update tests</a></li>
<li><a href="#orga901497">2.3. Update dependencies</a></li>
<li><a href="#org7c2bb21">2.4. Switch to lein-v for version management</a></li>
</ul>
</li>
<li><a href="#org622fbf9">3. Release 1.2.0</a>
<ul>
<li><a href="#org3835e5d">3.1. Update dependencies</a>
<ul>
<li><a href="#orgfc57db8">3.1.1. Update async-http-client to 1.9.39 (fixes issue #74)</a></li>
</ul>
</li>
<li><a href="#org2c3867b">3.2. Fix bug when destructuring map (blocker for clojure.spec)</a></li>
<li><a href="#org3ff5143">3.3. Add ability to configure read timeout</a></li>
<li><a href="#orgd2d4a92">3.4. Allow request options to be passed for websockets</a></li>
</ul>
</li>
<li><a href="#org540ead2">4. Release 1.1.0</a>
<ul>
<li><a href="#org815193d">4.1. Fix issue #69</a></li>
<li><a href="#org7c087dd">4.2. Add support for asynchronous close</a></li>
</ul>
</li>
<li><a href="#org34c31e7">5. Release 1.0.1</a>
<ul>
<li><a href="#org74f689a">5.1. Fix websocket support</a></li>
</ul>
</li>
<li><a href="#orgda6f448">6. Release 1.0.0</a>
<ul>
<li><a href="#orgc569741">6.1. Update to the latest version of AsyncHttpClient (1.9.31)</a>
<ul>
<li><a href="#orgccc2706">6.1.1. Remove `remove-params-on-redirect` option</a></li>
<li><a href="#org79ce265">6.1.2. Remove `async-connect` option</a></li>
<li><a href="#org05a3abf">6.1.3. Overhaul character set handling for multipart functions</a></li>
<li><a href="#org26200f5">6.1.4. Use more precise exceptions</a></li>
<li><a href="#org4b68f35">6.1.5. Move WebSocket implementation to its own namespace</a></li>
</ul>
</li>
<li><a href="#org579db4c">6.2. Use more idiomatic Clojure</a></li>
<li><a href="#orge9029ed">6.3. Extract websocket code to separate namespace</a></li>
<li><a href="#orgdd56316">6.4. Issue with the AsyncHttpClient Java library.</a></li>
</ul>
</li>
<li><a href="#orgb257117">7. Release 0.6.1</a>
<ul>
<li><a href="#org067d0fe">7.1. Allow websocket to take request options&#xa0;&#xa0;&#xa0;<span class="tag"><span class="enhancement">enhancement</span></span></a></li>
<li><a href="#org774bf13">7.2. Add logging to client create/close calls</a></li>
<li><a href="#orgc155207">7.3. Update dependencies, including Clojure</a></li>
</ul>
</li>
<li><a href="#orga88cfe1">8. Release 0.6.0</a>
<ul>
<li><a href="#org878a28d">8.1. Modernize Clojure syntax with `:require` and `:refer` instead of `:use`</a></li>
<li><a href="#org4588eef">8.2. Update com.ning/async-http-client dependency to 1.8.16</a>
<ul>
<li><a href="#orgef50d73">8.2.1. Handle new options and refactoring of Cookie class with maximum BC</a></li>
<li><a href="#orgbbc7ebe">8.2.2. Return java.net.UnknownHostException instead of java.net.ConnectException (with UnresolvedAddressexception cause) on bad host</a></li>
<li><a href="#org830747a">8.2.3. Add wrap? option to cookies</a></li>
<li><a href="#orga05f048">8.2.4. Return timeout and connection limit exceptions in `error` function instead of throwing an exception on request execution thread</a></li>
<li><a href="#org822fdd8">8.2.5. Return java.nio.charset.Charsets on multipart parts</a></li>
<li><a href="#org733a1c7">8.2.6. Default charset on StringPart (typically) is US-ASCII</a></li>
<li><a href="#org433a969">8.2.7. Remove `raw-url` function -it is no longer supported by the underlying Java AsyncHttpclient</a></li>
<li><a href="#org6c4a5bc">8.2.8. Add `uri` function to partially back fill for raw-url</a></li>
<li><a href="#orgcb0a5b4">8.2.9. Remove async connect functionality -connections are now always async</a></li>
<li><a href="#org6193497">8.2.10. Handle empty HttpResponseBodyPart in onBodyPartReceived</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org43c5616">9. Release 0.5.3</a>
<ul>
<li><a href="#orge131809">9.1. Update Clojure dependency to 1.6</a></li>
<li><a href="#org56323aa">9.2. Deprecate raw-url function and response key</a></li>
<li><a href="#org8d6ec0f">9.3. Restructure tests</a>
<ul>
<li><a href="#org037d1ab">9.3.1. Update jetty to 9.3.0.RC0</a></li>
<li><a href="#orgafac942">9.3.2. Update log dependencies</a></li>
<li><a href="#org80dc0fa">9.3.3. Provide fresh client to each test to resolve issue with Clojure 1.6</a></li>
<li><a href="#orgab2ebb5">9.3.4. Fix brittle tests</a></li>
</ul>
</li>
<li><a href="#orga8a28f6">9.4. Remove RequestBuilderWrapper</a></li>
<li><a href="#org9fe02fb">9.5. Update codox and lein-difftest plugins</a></li>
</ul>
</li>
<li><a href="#orgf73a6b4">10. Release 0.5.2</a></li>
<li><a href="#orge15f697">11. Release 0.5.1</a>
<ul>
<li><a href="#orgfa97bd3">11.1. remove-params-on-redirect</a></li>
<li><a href="#org4619034">11.2. Upgrade AHC to 1.7.10</a></li>
</ul>
</li>
<li><a href="#org9b9b2c5">12. Release 0.5.0</a>
<ul>
<li><a href="#org17e2104">12.1. http.async.client/content-type</a></li>
<li><a href="#org36d25b1">12.2. http.async.client/redirect?</a></li>
<li><a href="#orgb3ad3ca">12.3. http.async.client/location</a></li>
<li><a href="#org67f222f">12.4. Moved to Leiningen 2</a></li>
<li><a href="#org087c101">12.5. PATCH</a></li>
<li><a href="#org9de60e4">12.6. Initial WebSocket support</a></li>
<li><a href="#orgc2de633">12.7. Upgrade AHC to v1.7.5</a></li>
</ul>
</li>
<li><a href="#org5af9663">13. Release 0.4.5</a>
<ul>
<li><a href="#orga603dda">13.1. Multipart support</a></li>
<li><a href="#orgdbcc98c">13.2. Add convenience url and raw-url</a></li>
<li><a href="#org09580d5">13.3. There's a function for that!</a></li>
</ul>
</li>
<li><a href="#orgaf42eec">14. Release 0.4.4</a>
<ul>
<li><a href="#orge00f31d">14.1. Simplified callbacks API</a></li>
<li><a href="#orgf3de8f8">14.2. Better documented callbacks</a></li>
<li><a href="#org19c504c">14.3. Upgrade AHC to 1.7.4</a></li>
<li><a href="#org38ba738">14.4. Upgrade Clojure to 1.4</a></li>
</ul>
</li>
<li><a href="#orgbb40023">15. Release 0.4.3</a>
<ul>
<li><a href="#org273763e">15.1. Issue #30 by Cesar Canassa</a></li>
<li><a href="#orgf7dc84d">15.2. Upgrade AHC to 1.7.1</a></li>
</ul>
</li>
<li><a href="#orge7e0b3e">16. Release 0.4.2</a>
<ul>
<li><a href="#org4860f6c">16.1. Issue #29 by A. Diamond</a></li>
</ul>
</li>
<li><a href="#org9716fdd">17. Release 0.4.1</a>
<ul>
<li><a href="#org5b72a5e">17.1. Upgrade AHC to 1.7.0</a></li>
<li><a href="#org40b2ad3">17.2. Issues #26, #27, #28</a></li>
<li><a href="#orge6af00e">17.3. Improved logging</a></li>
<li><a href="#orgae1a30f">17.4. Tested against Clojure 1.4.0-beta1</a></li>
</ul>
</li>
<li><a href="#org82a62f9">18. Release 0.4.0</a>
<ul>
<li><a href="#org83372d2">18.1. Clojure 1.3 compatible</a></li>
<li><a href="#org60ce1e4">18.2. Support for multiple values for same key (QString)</a></li>
<li><a href="#org1b10dcf">18.3. Clojure contrib independent</a></li>
<li><a href="#orgc3139d9">18.4. Upgrade async-http-client to v1.6.5</a></li>
</ul>
</li>
<li><a href="#org67e902d">19. Release 0.3.1</a>
<ul>
<li><a href="#org56d1ba0">19.1. Upgrade async-http-client to v1.6.4</a></li>
</ul>
</li>
<li><a href="#orgde2bae5">20. Release 0.3.0</a>
<ul>
<li><a href="#orgfa2b809">20.1. Upgrade async-http-client to v1.6.3</a></li>
<li><a href="#org615c63b">20.2. Control over preemptive authentication</a></li>
<li><a href="#org3e3d04f">20.3. Explicit client usage</a></li>
<li><a href="#orgfc0f7e3">20.4. Removed with-client macro</a></li>
<li><a href="#org35a62e0">20.5. Clojure 1.2.1</a></li>
</ul>
</li>
<li><a href="#org0dfc100">21. Release 0.2.2</a>
<ul>
<li><a href="#orgac7b355">21.1. get-encoding helper works w/o Content-Type header</a></li>
<li><a href="#org7654e41">21.2. Upgrade async-http-client to v.1.5.0</a></li>
<li><a href="#org88d76da">21.3. Exposed more configuration options</a>
<ul>
<li><a href="#org65a0a75">21.3.1. Timeouts</a></li>
<li><a href="#org6201945">21.3.2. Proxy</a></li>
<li><a href="#orgeac1b35">21.3.3. Authentication</a></li>
</ul>
</li>
<li><a href="#org0c5f2df">21.4. Zero byte copy mode</a></li>
<li><a href="#orgada3cff">21.5. Allow providing your own poll</a></li>
<li><a href="#orgb1b28ae">21.6. Allow Asynchronous Connect</a></li>
<li><a href="#org518d8fd">21.7. Fix seq streaming API</a></li>
<li><a href="#org9af347e">21.8. Lots of performance improvements</a></li>
</ul>
</li>
<li><a href="#orgd668340">22. Release 0.2.1</a>
<ul>
<li><a href="#org7476938">22.1. Terminate body seq if errored&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></a></li>
<li><a href="#org81fbe3a">22.2. Canceling request</a></li>
<li><a href="#org1549cb4">22.3. Request timeout</a></li>
<li><a href="#org88cdff1">22.4. Close client</a></li>
<li><a href="#org950edd6">22.5. Upgrade to v1.3.2 of async-http-client</a></li>
</ul>
</li>
<li><a href="#org83f918a">23. Release 0.2.0</a>
<ul>
<li><a href="#org6fa61e5">23.1. Stream as seq</a></li>
<li><a href="#org7f1b091">23.2. Cookies</a></li>
<li><a href="#org98fc81c">23.3. Authentication support</a></li>
<li><a href="#org7f57b39">23.4. Proxy per request</a></li>
<li><a href="#org9be3fb2">23.5. Branding User-Agent</a></li>
<li><a href="#org8a63353">23.6. Keyworded maps in API</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga820956" class="outline-2">
<h2 id="orga820956"><span class="section-number-2">1</span> Release 1.3.1</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org278c82b" class="outline-3">
<h3 id="org278c82b"><span class="section-number-3">1.1</span> Update dependencies</h3>
</div>
</div>
<div id="outline-container-org056f486" class="outline-2">
<h2 id="org056f486"><span class="section-number-2">2</span> Release 1.3.0</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc039401" class="outline-3">
<h3 id="orgc039401"><span class="section-number-3">2.1</span> Update documentation</h3>
</div>
<div id="outline-container-org0304cca" class="outline-3">
<h3 id="org0304cca"><span class="section-number-3">2.2</span> Update tests</h3>
</div>
<div id="outline-container-orga901497" class="outline-3">
<h3 id="orga901497"><span class="section-number-3">2.3</span> Update dependencies</h3>
</div>
<div id="outline-container-org7c2bb21" class="outline-3">
<h3 id="org7c2bb21"><span class="section-number-3">2.4</span> Switch to <a href="https://github.com/roomkey/lein-v">lein-v</a> for version management</h3>
</div>
</div>
<div id="outline-container-org622fbf9" class="outline-2">
<h2 id="org622fbf9"><span class="section-number-2">3</span> Release 1.2.0</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3835e5d" class="outline-3">
<h3 id="org3835e5d"><span class="section-number-3">3.1</span> Update dependencies</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgfc57db8" class="outline-4">
<h4 id="orgfc57db8"><span class="section-number-4">3.1.1</span> Update async-http-client to 1.9.39 (fixes issue #74)</h4>
</div>
</div>
<div id="outline-container-org2c3867b" class="outline-3">
<h3 id="org2c3867b"><span class="section-number-3">3.2</span> Fix bug when destructuring map (blocker for clojure.spec)</h3>
</div>
<div id="outline-container-org3ff5143" class="outline-3">
<h3 id="org3ff5143"><span class="section-number-3">3.3</span> Add ability to configure read timeout</h3>
</div>
<div id="outline-container-orgd2d4a92" class="outline-3">
<h3 id="orgd2d4a92"><span class="section-number-3">3.4</span> Allow request options to be passed for websockets</h3>
</div>
</div>
<div id="outline-container-org540ead2" class="outline-2">
<h2 id="org540ead2"><span class="section-number-2">4</span> Release 1.1.0</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org815193d" class="outline-3">
<h3 id="org815193d"><span class="section-number-3">4.1</span> Fix issue #69</h3>
</div>
<div id="outline-container-org7c087dd" class="outline-3">
<h3 id="org7c087dd"><span class="section-number-3">4.2</span> Add support for asynchronous close</h3>
</div>
</div>
<div id="outline-container-org34c31e7" class="outline-2">
<h2 id="org34c31e7"><span class="section-number-2">5</span> Release 1.0.1</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org74f689a" class="outline-3">
<h3 id="org74f689a"><span class="section-number-3">5.1</span> Fix websocket support</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="https://github.com/cch1/http.async.client/issues/66">#66</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgda6f448" class="outline-2">
<h2 id="orgda6f448"><span class="section-number-2">6</span> Release 1.0.0</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgc569741" class="outline-3">
<h3 id="orgc569741"><span class="section-number-3">6.1</span> Update to the latest version of AsyncHttpClient (1.9.31)</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgccc2706" class="outline-4">
<h4 id="orgccc2706"><span class="section-number-4">6.1.1</span> Remove `remove-params-on-redirect` option</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
No longer supported by the underlying AsyncHttpClient library and of dubious value.
</p>
</div>
</div>
<div id="outline-container-org79ce265" class="outline-4">
<h4 id="org79ce265"><span class="section-number-4">6.1.2</span> Remove `async-connect` option</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
No longer supported by the underlying AsyncHttpClient library; all connections are performed asynchronously.
</p>
</div>
</div>
<div id="outline-container-org05a3abf" class="outline-4">
<h4 id="org05a3abf"><span class="section-number-4">6.1.3</span> Overhaul character set handling for multipart functions</h4>
</div>
