org/changelog.org
*** Use more precise exceptions
*** Move WebSocket implementation to its own namespace
** Use more idiomatic Clojure
** Extract websocket code to separate namespace
** Issue with the AsyncHttpClient Java library.
   See [[https://github.com/AsyncHttpClient/async-http-client/issues/996]] \\
   To workaround, set a realm with
   #+BEGIN_SRC clojure
{:preemptive true :target-proxy true}
   #+END_SRC
* Release 0.6.1
** Allow websocket to take request options :enhancement:
** Add logging to client create/close calls
** Update dependencies, including Clojure
* Release 0.6.0
** Modernize Clojure syntax with `:require` and `:refer` instead of `:use`
** Update com.ning/async-http-client dependency to 1.8.16
*** Handle new options and refactoring of Cookie class with maximum BC
    Add `expires`, `http-only?` and `wrap?` options to Cookie options
*** Return java.net.UnknownHostException instead of java.net.ConnectException (with UnresolvedAddressexception cause) on bad host
*** Add wrap? option to cookies
*** Return timeout and connection limit exceptions in `error` function instead of throwing an exception on request execution thread
*** Return java.nio.charset.Charsets on multipart parts
*** Default charset on StringPart (typically) is US-ASCII
*** Remove `raw-url` function -it is no longer supported by the underlying Java AsyncHttpclient
*** Add `uri` function to partially back fill for raw-url
*** Remove async connect functionality -connections are now always async
*** Handle empty HttpResponseBodyPart in onBodyPartReceived
    With an empty response body, 1.8.0 calls onBodyPartReceived with a zero- length HttpResponseBodyPart, while version 1.7.x did not even call onBodyPartReceived.
* Release 0.5.3
** Update Clojure dependency to 1.6
** Deprecate raw-url function and response key
   Due to lack of support in future versions of the com.ning/async-http-client, raw-url will not be
   supported in future versions.
** Restructure tests
*** Update jetty to 9.3.0.RC0
*** Update log dependencies
*** Provide fresh client to each test to resolve issue with Clojure 1.6
*** Fix brittle tests
** Remove RequestBuilderWrapper
** Update codox and lein-difftest plugins
* Release 0.5.2
  Compile with Java 1.6
* Release 0.5.1
** remove-params-on-redirect
   Issues [[https://github.com/cch1/http.async.client/issues/46][#46]], [[https://github.com/cch1/http.async.client/issues/47][#47]] and [[https://github.com/cch1/http.async.client/issues/48][#48]] by [[https://github.com/josephwilk][Joseph Wilk]].
** Upgrade AHC to 1.7.10
* Release 0.5.0
** [[http://cch1.github.io/http.async.client/doc/http.async.client.html#var-content-type][http.async.client/content-type]]
   Added utility fn for [[http://cch1.github.io/http.async.client/docs.html#sec-2-5-5][Reading content-type]].
** [[http://cch1.github.io/http.async.client/doc/http.async.client.html#var-redirect%3F][http.async.client/redirect?]]
   Added utility fn for checking if response [[http://cch1.github.io/http.async.client/docs.html#sec-2-5-3][Is redirect?]].
** [[http://cch1.github.io/http.async.client/doc/http.async.client.html#var-location][http.async.client/location]]
   Added utility fn for [[http://cch1.github.io/http.async.client/docs.html#sec-2-5-6][Reading location]].
** Moved to Leiningen 2
** [[http://cch1.github.io/http.async.client/doc/http.async.client.html#var-PATCH][PATCH]]
   Added support for HTTP PATCH method.
** Initial WebSocket support
   Not documented yet, [[https://github.com/cch1/http.async.client/blob/07b8f1de8f956505185ed224c71abceeff27265f/src/clj/http/async/client.clj#L305][Code is here]].
   Demo usage can be found in [[https://github.com/cch1/hac-live][hac-live]] dome for EuroClojure 2012.
   [[https://github.com/cch1/hac-live/blob/master/src/hac/live.clj#L261][Request 12]] and [[https://github.com/cch1/hac-live/blob/master/src/hac/live.clj#L285][Request 13]] are WebSocket examples.
** Upgrade AHC to v1.7.5

* Release 0.4.5
** Multipart support
   Allow POST and PUT to send multipart messages.
   When *vector* is provided as body it is treated as multipart.
   Please consult documentation and tests for examples of usage.
