changelog.html
<div id="outline-container-org26200f5" class="outline-4">
<h4 id="org26200f5"><span class="section-number-4">6.1.4</span> Use more precise exceptions</h4>
</div>
<div id="outline-container-org4b68f35" class="outline-4">
<h4 id="org4b68f35"><span class="section-number-4">6.1.5</span> Move WebSocket implementation to its own namespace</h4>
</div>
</div>
<div id="outline-container-org579db4c" class="outline-3">
<h3 id="org579db4c"><span class="section-number-3">6.2</span> Use more idiomatic Clojure</h3>
</div>
<div id="outline-container-orge9029ed" class="outline-3">
<h3 id="orge9029ed"><span class="section-number-3">6.3</span> Extract websocket code to separate namespace</h3>
</div>
<div id="outline-container-orgdd56316" class="outline-3">
<h3 id="orgdd56316"><span class="section-number-3">6.4</span> Issue with the AsyncHttpClient Java library.</h3>
<div class="outline-text-3" id="text-6-4">
<p>
See <a href="https://github.com/AsyncHttpClient/async-http-client/issues/996">https://github.com/AsyncHttpClient/async-http-client/issues/996</a> <br />
To workaround, set a realm with
</p>
<div class="org-src-container">
<pre class="src src-clojure">{:preemptive true :target-proxy true}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb257117" class="outline-2">
<h2 id="orgb257117"><span class="section-number-2">7</span> Release 0.6.1</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org067d0fe" class="outline-3">
<h3 id="org067d0fe"><span class="section-number-3">7.1</span> Allow websocket to take request options&#xa0;&#xa0;&#xa0;<span class="tag"><span class="enhancement">enhancement</span></span></h3>
</div>
<div id="outline-container-org774bf13" class="outline-3">
<h3 id="org774bf13"><span class="section-number-3">7.2</span> Add logging to client create/close calls</h3>
</div>
<div id="outline-container-orgc155207" class="outline-3">
<h3 id="orgc155207"><span class="section-number-3">7.3</span> Update dependencies, including Clojure</h3>
</div>
</div>
<div id="outline-container-orga88cfe1" class="outline-2">
<h2 id="orga88cfe1"><span class="section-number-2">8</span> Release 0.6.0</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org878a28d" class="outline-3">
<h3 id="org878a28d"><span class="section-number-3">8.1</span> Modernize Clojure syntax with `:require` and `:refer` instead of `:use`</h3>
</div>
<div id="outline-container-org4588eef" class="outline-3">
<h3 id="org4588eef"><span class="section-number-3">8.2</span> Update com.ning/async-http-client dependency to 1.8.16</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgef50d73" class="outline-4">
<h4 id="orgef50d73"><span class="section-number-4">8.2.1</span> Handle new options and refactoring of Cookie class with maximum BC</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
Add `expires`, `http-only?` and `wrap?` options to Cookie options
</p>
</div>
</div>
<div id="outline-container-orgbbc7ebe" class="outline-4">
<h4 id="orgbbc7ebe"><span class="section-number-4">8.2.2</span> Return java.net.UnknownHostException instead of java.net.ConnectException (with UnresolvedAddressexception cause) on bad host</h4>
</div>
<div id="outline-container-org830747a" class="outline-4">
<h4 id="org830747a"><span class="section-number-4">8.2.3</span> Add wrap? option to cookies</h4>
</div>
<div id="outline-container-orga05f048" class="outline-4">
<h4 id="orga05f048"><span class="section-number-4">8.2.4</span> Return timeout and connection limit exceptions in `error` function instead of throwing an exception on request execution thread</h4>
</div>
<div id="outline-container-org822fdd8" class="outline-4">
<h4 id="org822fdd8"><span class="section-number-4">8.2.5</span> Return java.nio.charset.Charsets on multipart parts</h4>
</div>
<div id="outline-container-org733a1c7" class="outline-4">
<h4 id="org733a1c7"><span class="section-number-4">8.2.6</span> Default charset on StringPart (typically) is US-ASCII</h4>
</div>
<div id="outline-container-org433a969" class="outline-4">
<h4 id="org433a969"><span class="section-number-4">8.2.7</span> Remove `raw-url` function -it is no longer supported by the underlying Java AsyncHttpclient</h4>
</div>
<div id="outline-container-org6c4a5bc" class="outline-4">
<h4 id="org6c4a5bc"><span class="section-number-4">8.2.8</span> Add `uri` function to partially back fill for raw-url</h4>
</div>
<div id="outline-container-orgcb0a5b4" class="outline-4">
<h4 id="orgcb0a5b4"><span class="section-number-4">8.2.9</span> Remove async connect functionality -connections are now always async</h4>
</div>
<div id="outline-container-org6193497" class="outline-4">
<h4 id="org6193497"><span class="section-number-4">8.2.10</span> Handle empty HttpResponseBodyPart in onBodyPartReceived</h4>
<div class="outline-text-4" id="text-8-2-10">
<p>
With an empty response body, 1.8.0 calls onBodyPartReceived with a zero- length HttpResponseBodyPart, while version 1.7.x did not even call onBodyPartReceived.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org43c5616" class="outline-2">
<h2 id="org43c5616"><span class="section-number-2">9</span> Release 0.5.3</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge131809" class="outline-3">
<h3 id="orge131809"><span class="section-number-3">9.1</span> Update Clojure dependency to 1.6</h3>
</div>
<div id="outline-container-org56323aa" class="outline-3">
<h3 id="org56323aa"><span class="section-number-3">9.2</span> Deprecate raw-url function and response key</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Due to lack of support in future versions of the com.ning/async-http-client, raw-url will not be
supported in future versions.
</p>
</div>
</div>
<div id="outline-container-org8d6ec0f" class="outline-3">
<h3 id="org8d6ec0f"><span class="section-number-3">9.3</span> Restructure tests</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org037d1ab" class="outline-4">
<h4 id="org037d1ab"><span class="section-number-4">9.3.1</span> Update jetty to 9.3.0.RC0</h4>
</div>
<div id="outline-container-orgafac942" class="outline-4">
<h4 id="orgafac942"><span class="section-number-4">9.3.2</span> Update log dependencies</h4>
</div>
<div id="outline-container-org80dc0fa" class="outline-4">
<h4 id="org80dc0fa"><span class="section-number-4">9.3.3</span> Provide fresh client to each test to resolve issue with Clojure 1.6</h4>
</div>
<div id="outline-container-orgab2ebb5" class="outline-4">
<h4 id="orgab2ebb5"><span class="section-number-4">9.3.4</span> Fix brittle tests</h4>
</div>
</div>
<div id="outline-container-orga8a28f6" class="outline-3">
<h3 id="orga8a28f6"><span class="section-number-3">9.4</span> Remove RequestBuilderWrapper</h3>
</div>
<div id="outline-container-org9fe02fb" class="outline-3">
<h3 id="org9fe02fb"><span class="section-number-3">9.5</span> Update codox and lein-difftest plugins</h3>
</div>
</div>
<div id="outline-container-orgf73a6b4" class="outline-2">
<h2 id="orgf73a6b4"><span class="section-number-2">10</span> Release 0.5.2</h2>
<div class="outline-text-2" id="text-10">
<p>
Compile with Java 1.6
</p>
</div>
</div>
<div id="outline-container-orge15f697" class="outline-2">
<h2 id="orge15f697"><span class="section-number-2">11</span> Release 0.5.1</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgfa97bd3" class="outline-3">
<h3 id="orgfa97bd3"><span class="section-number-3">11.1</span> remove-params-on-redirect</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Issues <a href="https://github.com/cch1/http.async.client/issues/46">#46</a>, <a href="https://github.com/cch1/http.async.client/issues/47">#47</a> and <a href="https://github.com/cch1/http.async.client/issues/48">#48</a> by <a href="https://github.com/josephwilk">Joseph Wilk</a>.
</p>
</div>
</div>
<div id="outline-container-org4619034" class="outline-3">
<h3 id="org4619034"><span class="section-number-3">11.2</span> Upgrade AHC to 1.7.10</h3>
</div>
</div>
<div id="outline-container-org9b9b2c5" class="outline-2">
<h2 id="org9b9b2c5"><span class="section-number-2">12</span> Release 0.5.0</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org17e2104" class="outline-3">
<h3 id="org17e2104"><span class="section-number-3">12.1</span> <a href="http://cch1.github.io/http.async.client/doc/http.async.client.html#var-content-type">http.async.client/content-type</a></h3>
<div class="outline-text-3" id="text-12-1">
<p>
Added utility fn for <a href="http://cch1.github.io/http.async.client/docs.html#sec-2-5-5">Reading content-type</a>.
</p>
</div>
</div>
<div id="outline-container-org36d25b1" class="outline-3">
<h3 id="org36d25b1"><span class="section-number-3">12.2</span> <a href="http://cch1.github.io/http.async.client/doc/http.async.client.html#var-redirect?">http.async.client/redirect?</a></h3>
<div class="outline-text-3" id="text-12-2">
<p>
Added utility fn for checking if response <a href="http://cch1.github.io/http.async.client/docs.html#sec-2-5-3">Is redirect?</a>.
</p>
</div>
</div>
<div id="outline-container-orgb3ad3ca" class="outline-3">
<h3 id="orgb3ad3ca"><span class="section-number-3">12.3</span> <a href="http://cch1.github.io/http.async.client/doc/http.async.client.html#var-location">http.async.client/location</a></h3>
<div class="outline-text-3" id="text-12-3">
<p>
Added utility fn for <a href="http://cch1.github.io/http.async.client/docs.html#sec-2-5-6">Reading location</a>.
</p>
</div>
</div>
<div id="outline-container-org67f222f" class="outline-3">
<h3 id="org67f222f"><span class="section-number-3">12.4</span> Moved to Leiningen 2</h3>
</div>
<div id="outline-container-org087c101" class="outline-3">
<h3 id="org087c101"><span class="section-number-3">12.5</span> <a href="http://cch1.github.io/http.async.client/doc/http.async.client.html#var-PATCH">PATCH</a></h3>
<div class="outline-text-3" id="text-12-5">
<p>
Added support for HTTP PATCH method.
</p>
</div>
</div>
<div id="outline-container-org9de60e4" class="outline-3">
<h3 id="org9de60e4"><span class="section-number-3">12.6</span> Initial WebSocket support</h3>
<div class="outline-text-3" id="text-12-6">
<p>
Not documented yet, <a href="https://github.com/cch1/http.async.client/blob/07b8f1de8f956505185ed224c71abceeff27265f/src/clj/http/async/client.clj#L305">Code is here</a>.
Demo usage can be found in <a href="https://github.com/cch1/hac-live">hac-live</a> dome for EuroClojure 2012.
<a href="https://github.com/cch1/hac-live/blob/master/src/hac/live.clj#L261">Request 12</a> and <a href="https://github.com/cch1/hac-live/blob/master/src/hac/live.clj#L285">Request 13</a> are WebSocket examples.
</p>
</div>
</div>
<div id="outline-container-orgc2de633" class="outline-3">
<h3 id="orgc2de633"><span class="section-number-3">12.7</span> Upgrade AHC to v1.7.5</h3>
</div>
</div>

<div id="outline-container-org5af9663" class="outline-2">
<h2 id="org5af9663"><span class="section-number-2">13</span> Release 0.4.5</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orga603dda" class="outline-3">
<h3 id="orga603dda"><span class="section-number-3">13.1</span> Multipart support</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Allow POST and PUT to send multipart messages.
When <b>vector</b> is provided as body it is treated as multipart.
Please consult documentation and tests for examples of usage.
</p>
</div>
</div>
