changelog.html
<div id="outline-container-orgdbcc98c" class="outline-3">
<h3 id="orgdbcc98c"><span class="section-number-3">13.2</span> Add convenience url and raw-url</h3>
<div class="outline-text-3" id="text-13-2">
<p>
<a href="https://github.com/cch1/http.async.client/issues/35">#35</a>. Allow easy retrieval of URL used to request resource.
</p>
</div>
</div>
<div id="outline-container-org09580d5" class="outline-3">
<h3 id="org09580d5"><span class="section-number-3">13.3</span> There's a function for that!</h3>
<div class="outline-text-3" id="text-13-3">
<p>
Listen to what kibit has to say.
</p>
</div>
</div>
</div>
<div id="outline-container-orgaf42eec" class="outline-2">
<h2 id="orgaf42eec"><span class="section-number-2">14</span> Release 0.4.4</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orge00f31d" class="outline-3">
<h3 id="orge00f31d"><span class="section-number-3">14.1</span> Simplified callbacks API</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Issue <a href="https://github.com/cch1/http.async.client/issues/32">#32</a>.
</p>
</div>
</div>
<div id="outline-container-orgf3de8f8" class="outline-3">
<h3 id="orgf3de8f8"><span class="section-number-3">14.2</span> Better documented callbacks</h3>
<div class="outline-text-3" id="text-14-2">
<p>
This was long outstanding issue <a href="https://github.com/cch1/http.async.client/issues/12">#12</a>.
</p>
</div>
</div>
<div id="outline-container-org19c504c" class="outline-3">
<h3 id="org19c504c"><span class="section-number-3">14.3</span> Upgrade <a href="https://github.com/sonatype/async-http-client">AHC</a> to 1.7.4</h3>
</div>
<div id="outline-container-org38ba738" class="outline-3">
<h3 id="org38ba738"><span class="section-number-3">14.4</span> Upgrade Clojure to 1.4</h3>
</div>
</div>
<div id="outline-container-orgbb40023" class="outline-2">
<h2 id="orgbb40023"><span class="section-number-2">15</span> Release 0.4.3</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org273763e" class="outline-3">
<h3 id="org273763e"><span class="section-number-3">15.1</span> Issue <a href="https://github.com/cch1/http.async.client/pull/30">#30</a> by <a href="https://github.com/canassa">Cesar Canassa</a></h3>
<div class="outline-text-3" id="text-15-1">
<p>
Fixes issue with single cookie in response.
</p>
</div>
</div>
<div id="outline-container-orgf7dc84d" class="outline-3">
<h3 id="orgf7dc84d"><span class="section-number-3">15.2</span> Upgrade AHC to 1.7.1</h3>
</div>
</div>
<div id="outline-container-orge7e0b3e" class="outline-2">
<h2 id="orge7e0b3e"><span class="section-number-2">16</span> Release 0.4.2</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org4860f6c" class="outline-3">
<h3 id="org4860f6c"><span class="section-number-3">16.1</span> Issue <a href="https://github.com/cch1/http.async.client/pull/29">#29</a> by <a href="https://github.com/diamondap">A. Diamond</a></h3>
<div class="outline-text-3" id="text-16-1">
<p>
Added support for client certificates.
</p>
</div>
</div>
</div>
<div id="outline-container-org9716fdd" class="outline-2">
<h2 id="org9716fdd"><span class="section-number-2">17</span> Release 0.4.1</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-org5b72a5e" class="outline-3">
<h3 id="org5b72a5e"><span class="section-number-3">17.1</span> Upgrade AHC to 1.7.0</h3>
</div>
<div id="outline-container-org40b2ad3" class="outline-3">
<h3 id="org40b2ad3"><span class="section-number-3">17.2</span> Issues <a href="https://github.com/cch1/http.async.client/issues/26">#26</a>, <a href="https://github.com/cch1/http.async.client/issues/27">#27</a>, <a href="https://github.com/cch1/http.async.client/issues/28">#28</a></h3>
<div class="outline-text-3" id="text-17-2">
<dl class="org-dl">
<dt><a href="https://github.com/cch1/http.async.client/issues/26">#26</a></dt><dd><a href="https://github.com/jkk">Justin Kramer</a>, <a href="https://github.com/btatnall">Brian Tatnall</a>
Empty response body hangs c/body, c/string</dd>
<dt><a href="https://github.com/cch1/http.async.client/issues/27">#27</a></dt><dd><a href="https://github.com/jkk">Justin Kramer</a>
create-client's :idle-in-pool-timeout option not being set
correctly</dd>
<dt><a href="https://github.com/cch1/http.async.client/pull/28">#28</a></dt><dd><a href="https://github.com/klang">Karsten Lang</a>
Documentation update</dd>
</dl>
</div>
</div>
<div id="outline-container-orge6af00e" class="outline-3">
<h3 id="orge6af00e"><span class="section-number-3">17.3</span> Improved logging</h3>
<div class="outline-text-3" id="text-17-3">
<p>
Improved logging configuration for running tests.
</p>
</div>
</div>
<div id="outline-container-orgae1a30f" class="outline-3">
<h3 id="orgae1a30f"><span class="section-number-3">17.4</span> Tested against Clojure 1.4.0-beta1</h3>
</div>
</div>
<div id="outline-container-org82a62f9" class="outline-2">
<h2 id="org82a62f9"><span class="section-number-2">18</span> Release 0.4.0</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org83372d2" class="outline-3">
<h3 id="org83372d2"><span class="section-number-3">18.1</span> Clojure 1.3 compatible</h3>
</div>
<div id="outline-container-org60ce1e4" class="outline-3">
<h3 id="org60ce1e4"><span class="section-number-3">18.2</span> Support for multiple values for same key (QString)</h3>
<div class="outline-text-3" id="text-18-2">
<p>
<a href="https://github.com/cch1/http.async.client/issues/22">#22</a>
</p>
</div>
</div>
<div id="outline-container-org1b10dcf" class="outline-3">
<h3 id="org1b10dcf"><span class="section-number-3">18.3</span> Clojure contrib independent</h3>
<div class="outline-text-3" id="text-18-3">
<p>
<a href="https://github.com/cch1/http.async.client/pull/24">#24</a>
</p>
</div>
</div>
<div id="outline-container-orgc3139d9" class="outline-3">
<h3 id="orgc3139d9"><span class="section-number-3">18.4</span> Upgrade async-http-client to v1.6.5</h3>
</div>
</div>
<div id="outline-container-org67e902d" class="outline-2">
<h2 id="org67e902d"><span class="section-number-2">19</span> Release 0.3.1</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org56d1ba0" class="outline-3">
<h3 id="org56d1ba0"><span class="section-number-3">19.1</span> Upgrade async-http-client to v1.6.4</h3>
</div>
</div>
<div id="outline-container-orgde2bae5" class="outline-2">
<h2 id="orgde2bae5"><span class="section-number-2">20</span> Release 0.3.0</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-orgfa2b809" class="outline-3">
<h3 id="orgfa2b809"><span class="section-number-3">20.1</span> Upgrade async-http-client to v1.6.3</h3>
</div>
<div id="outline-container-org615c63b" class="outline-3">
<h3 id="org615c63b"><span class="section-number-3">20.2</span> Control over preemptive authentication</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Patch provided by xeqi.
</p>
</div>
</div>
<div id="outline-container-org3e3d04f" class="outline-3">
<h3 id="org3e3d04f"><span class="section-number-3">20.3</span> Explicit client usage</h3>
<div class="outline-text-3" id="text-20-3">
<p>
Now following functions require client as first argument:
</p>
<ul class="org-ul">
<li>GET</li>
<li>PUT</li>
<li>POST</li>
<li>DELETE</li>
<li>HEAD</li>
<li>OPTIONS</li>
<li>request-stream</li>
<li>stream-seq</li>
<li>execute-request</li>
</ul>
<p>
You still create client with create-client function.
</p>
</div>
</div>
<div id="outline-container-orgfc0f7e3" class="outline-3">
<h3 id="orgfc0f7e3"><span class="section-number-3">20.4</span> Removed with-client macro</h3>
<div class="outline-text-3" id="text-20-4">
<p>
This didn't really bring much value.
Migration path.
From:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(with-client {:key val}
  ;; client usage
  (let [resp (GET url)]))
</pre>
</div>
<p>
To:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(with-open [client (create-client :key val)]
  ;; client usage
  (let [resp (GET client url)]))
</pre>
</div>
</div>
</div>
<div id="outline-container-org35a62e0" class="outline-3">
<h3 id="org35a62e0"><span class="section-number-3">20.5</span> Clojure 1.2.1</h3>
<div class="outline-text-3" id="text-20-5">
<p>
Fixed cyclic dependency that was preventing http.async.client from
been used in Clojure 1.2.1.
</p>
</div>
</div>
</div>
<div id="outline-container-org0dfc100" class="outline-2">
<h2 id="org0dfc100"><span class="section-number-2">21</span> Release 0.2.2</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-orgac7b355" class="outline-3">
<h3 id="orgac7b355"><span class="section-number-3">21.1</span> get-encoding helper works w/o Content-Type header</h3>
</div>
<div id="outline-container-org7654e41" class="outline-3">
<h3 id="org7654e41"><span class="section-number-3">21.2</span> Upgrade async-http-client to v.1.5.0</h3>
</div>
<div id="outline-container-org88d76da" class="outline-3">
<h3 id="org88d76da"><span class="section-number-3">21.3</span> Exposed more configuration options</h3>
<div class="outline-text-3" id="text-21-3">
</div>
<div id="outline-container-org65a0a75" class="outline-4">
<h4 id="org65a0a75"><span class="section-number-4">21.3.1</span> Timeouts</h4>
</div>
<div id="outline-container-org6201945" class="outline-4">
<h4 id="org6201945"><span class="section-number-4">21.3.2</span> Proxy</h4>
</div>
<div id="outline-container-orgeac1b35" class="outline-4">
<h4 id="orgeac1b35"><span class="section-number-4">21.3.3</span> Authentication</h4>
</div>
</div>
<div id="outline-container-org0c5f2df" class="outline-3">
<h3 id="org0c5f2df"><span class="section-number-3">21.4</span> Zero byte copy mode</h3>
<div class="outline-text-3" id="text-21-4">
<p>
If sending File as body, zero byte copy is used.
</p>
</div>
</div>
<div id="outline-container-orgada3cff" class="outline-3">
<h3 id="orgada3cff"><span class="section-number-3">21.5</span> Allow providing your own poll</h3>
<div class="outline-text-3" id="text-21-5">
<p>
Vadim Geshel contribution.
</p>
</div>
</div>
<div id="outline-container-orgb1b28ae" class="outline-3">
<h3 id="orgb1b28ae"><span class="section-number-3">21.6</span> Allow Asynchronous Connect</h3>
<div class="outline-text-3" id="text-21-6">
<p>
Vadim Geshel contribution.
</p>
</div>
</div>
<div id="outline-container-org518d8fd" class="outline-3">
<h3 id="org518d8fd"><span class="section-number-3">21.7</span> Fix seq streaming API</h3>
<div class="outline-text-3" id="text-21-7">
<p>
Previous versions of seq streaming API have been holding to head,
not anymore.
</p>
</div>
</div>
<div id="outline-container-org9af347e" class="outline-3">
<h3 id="org9af347e"><span class="section-number-3">21.8</span> Lots of performance improvements</h3>
<div class="outline-text-3" id="text-21-8">
<p>
Underlying async-http-client has undergone serious optimization
changes.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd668340" class="outline-2">
<h2 id="orgd668340"><span class="section-number-2">22</span> Release 0.2.1</h2>
<div class="outline-text-2" id="text-22">
</div>
<div id="outline-container-org7476938" class="outline-3">
<h3 id="org7476938"><span class="section-number-3">22.1</span> Terminate body seq if errored&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bug">bug</span></span></h3>
</div>
<div id="outline-container-org81fbe3a" class="outline-3">
<h3 id="org81fbe3a"><span class="section-number-3">22.2</span> Canceling request</h3>
<div class="outline-text-3" id="text-22-2">
<p>
<b>http.async.client/cancel</b> and <b>http.async.client/canceled?</b>
</p>
</div>
</div>
